from bs4 import BeautifulSoup
import requests
link = str(input())
req = requests.get(link).text
soup = BeautifulSoup(req, "lxml")
imena = ['Александра', 'Алина', 'Алла', 'Анастасия', 'Анжела', 'Анна', 'Антонина', 'Валентина', 'Валерия', 'Вероника', 'Виктория', 'Галина', 'Дарья', 'Евгения',
'Екатерина', 'Елена', 'Елизавета', 'Карина', 'Кира', 'Клавдия', 'Кристина', 'Ксения', 'Лидия', 'Любовь', 'Людмила', 'Маргарита', 'Марина', 'Мария', 'Надежда', 'Наталья', 'Нина', 'Оксана', 'Олеся', 'Ольга', 'Полина', 'Светлана', 'Таисия', 'Тамара', 'Татьяна', 'Эвелина', 'Эльвира', 'Юлиана', 'Юлия', 'Яна', 'Александр',
'Алексей', 'Анатолий', 'Андрей', 'Антон', 'Аркадий', 'Артем', 'Борислав', 'Вадим', 'Валентин', 'Валерий', 'Василий', 'Виктор', 'Виталий', 'Владимир', 'Вячеслав', 'Геннадий', 'Георгий', 'Григорий', 'Даниил', 'Денис', 'Дмитрий', 'Евгений', 'Егор', 'Иван', 'Игорь', 'Илья', 'Кирилл', 'Лев', 'Максим', 'Михаил', 'Никита', 'Николай', 'Олег', 'Семен', 'Сергей', 'Станислав', 'Степан', 'Федор', 'Юрий', 'Данил', 'Даниил']
aut = soup.find_all('a')
f = 0
for i in range(len(aut)):
    p = aut[i].text
    str = p.split()



    for j in range(len(str)):
        for l in range(len(imena)):

             if str[j] == imena[l]:
                f=1


                imya=str[j]+str[j+1]
                break
        if (len(imya)!=0):
            break

print(imya)





if (f==1):
    print('Автор:',' ', imya)
